{"basics":{"name":"Sung-Un Park","label":"Staff Engineer","image":"","email":"park@stoz.kr","phone":"","url":"https://cv.stoz.kr","summary":"Staff engineer at the AI Center, Samsung Electronics.",},"work":[{"name":"AI Center, Samsung Electronics","position":"Staff Researcher, Process/Equipment AI Lab","url":"https://www.samsung.com/","startDate":"2017-02-01","endDate":"","summary":"Joined the AI Center (formerly the AI Research Center at SAIT) in February 2017 and currently works as a staff researcher in the Process/Equipment AI Lab focusing on process and equipment AI for semiconductor manufacturing and mobile devices.","highlights":["Virtual Metrology (May 2024-Present): Developed machine-learning-based virtual metrology to predict wafer properties from process data without physical measurements, enabling real-time quality control and improved yield prediction in semiconductor manufacturing.","3D Depth Metrology for Semiconductors (Jan 2022-May 2024): Built deep-learning algorithms to estimate the three-dimensional shape of semiconductor structures from SEM images.","Biometrics Anti-Spoofing System for Galaxy S series (Sep 2019-Sep 2022): Designed the on-device fingerprint anti-spoofing system and engineered robust spoof-detection algorithms adapted to diverse user conditions.","Bixby Wake-up and Unlock System (Jul 2018-Aug 2019): Designed and implemented the core software architecture for the Bixby speaker-recognition system and developed noise-robust speaker-recognition and user-enrollment algorithms.","Intelligent Scan for Galaxy S9/Note 9 (Aug 2017-Jun 2018): Contributed to designing the Intelligent Scan system that combines iris scanning and face recognition, including multimodal face-liveness detection, landmark alignment and latency optimisation.","Face Recognition for Galaxy S8/Note 8 (Mar 2017-Jul 2017): Participated in face-recognition system development and integrated the code into a mobile system for release."]},{"name":"Bio-Imaging Lab., Kyung Hee University","position":"Researcher","url":"https://www.khu.ac.kr/","startDate":"2013-05-01","endDate":"2017-01-01","summary":"Conducted graduate-level research at the Bio-Imaging & Brain Engineering Lab focusing on depth-sensor-based human-activity recognition and industrial collaborations.","highlights":["Thesis Research: Developed a system that recognises human activities (walking, jumping, raising arms, etc.) using a depth camera and recurrent neural networks with joint-angle information from depth image sequences.","Automatic TFT-LCD panel defect detection (Jul 2016-Dec 2016): Created a real-time system that finds defects in the manufacturing process of TFT-LCD panels and classifies them using convolutional neural networks.","Human Image Retrieval System (Nov 2015-Mar 2016): Built a CNN-based image-retrieval system to classify and search images containing humans.","Automatic Sleep Stage Classification System (2015): Developed an algorithm for automated sleep-stage classification using six-channel EEG, EMG and EOG data; achieved 87 % accuracy compared with manual scoring and validated its clinical applicability."]},{"name":"Samsung Software Membership (Samsung Electronics)","position":"Software Engineer","url":"https://www.samsung.com/","startDate":"2013-01-01","endDate":"2015-03-01","summary":"Participated in Samsung’s Software Membership programme, developing various software projects and being recognised for excellent work.","highlights":["Developed trading-business information applications that provided technical-barrier-to-trade information and harmonised-system codes; received an Excellent Development award at the Technical Standard Idea Software Contest.","Created an online sticky-note application for collaborative brainstorming where multiple users could view and edit notes synchronously (2014).","Built an ARS speech-to-text application to visualise ARS voice and was awarded at the Samsung Software Membership Tech Fair 2014.","Developed an Android MAME emulator with Wi-Fi direct connection for multiplayer gaming.","Improved developer experience through usability evaluation of the Tizen 2.2.1 SDK and compliance tests and created the \"Easy Travel\" mobile itinerary app."]}],"education":[{"institution":"Korea Advanced Institute of Science and Technology","location":"Daejeon, Republic of Korea","url":"https://www.kaist.ac.kr/","area":"Electrical Engineering","studyType":"Ph.D. Student","startDate":"2021-08-01","endDate":"","score":"","courses":[],"summary":"Ph.D. student in Electrical Engineering conducting research on machine-learning-based visual intelligence in the Computational Intelligence Lab under Prof. Changick Kim"},{"institution":"Kyung Hee University","location":"Yongin, Republic of Korea","url":"https://www.khu.ac.kr/","area":"Biomedical Engineering","studyType":"M.S.","startDate":"2015-03-01","endDate":"2017-02-01","score":"","courses":[],"summary":"Earned an M.S. in Biomedical Engineering; thesis titled \"A Depth Camera-based Human Activity Recognition via Deep Learning Recurrent Neural Network\" supervised by Prof. Tae-Seong Kim at the Bio-Imaging & Brain Engineering Lab."},{"institution":"Kyung Hee University","location":"Yongin, Republic of Korea","url":"https://www.khu.ac.kr/","area":"Biomedical Engineering and Computer Engineering","studyType":"B.S.","startDate":"2009-03-01","endDate":"2015-02-01","score":"","courses":[],"summary":"Completed dual bachelor’s degrees in Biomedical Engineering and Computer Engineering; served as Student Council President, participated in the Samsung Software Membership and performed mandatory military service in the Republic of Korea Army (Oct 2010-Jul 2012)"}],"awards":[{"title":"SAIT Vision Award - Best Challenge","date":"2024-08-13","awarder":"Samsung Advanced Institute of Technology","url":"","summary":"Received the Best Challenge award at SAIT Vision Awards for the first half of 2024."},{"title":"Samsung Best Paper Award - Silver","date":"2021-10-20","awarder":"Samsung Electronics","url":"","summary":"Won the Silver award in the Samsung Best Paper Award for the paper \"Fast and Robust Fingerprint Anti-Spoofing for Mobile Devices via Joint Contrastive Learning\"."},{"title":"Samsung Best Paper Award - Bronze","date":"2019-10-01","awarder":"Samsung Electronics","url":"","summary":"Received the Bronze award in the Samsung Best Paper Award for research on Bayesian speaker verification using orthogonal deep representation."},{"title":"Samsung Future Creator Award (Device Solution)","date":"2019-04-25","awarder":"Samsung Electronics","url":"","summary":"Honoured with the Future Creator Award (Device Solution) for the first quarter of 2019."},{"title":"Boundless Search for Breakthroughs Award (Innovation)","date":"2018-01-03","awarder":"Samsung Advanced Institute of Technology","url":"","summary":"Recognised for innovation with the Boundless Search for Breakthroughs Award in the second half of 2017."},{"title":"Excellent Development Award - Technical Standard Idea Software Contest","date":"2015-04-01","awarder":"Korean Agency for Technology and Standards","url":"","summary":"Awarded for excellent development in the 2015 Technical Standard Idea Software Contest."},{"title":"Samsung Software Membership Technology Fair - Excellent Project","date":"2014-09-01","awarder":"Samsung Electronics","url":"","summary":"Team selected as regional representatives and recognised for an excellent project at the 2014 Samsung Software Membership Technology Fair."}],"publications":[{"name":"A Depth Camera-based Human Activity Recognition via Deep Learning Recurrent Neural Network for Health and Social Care Services","publisher":"Conference on Health and Social Care Information Systems and Technologies (HCIst 2016)","releaseDate":"2016-10-05","url":"","summary":"Describes a depth-camera-based human-activity recognition system using recurrent neural networks for health and social-care applications."},{"name":"PRIME: Deep Imbalanced Regression with Proxies","publisher":"International Conference on Machine Learning (ICML 2025)","releaseDate":"2025-07-17","url":"","summary":"Introduces PRIME, a method for deep imbalanced regression using proxies to handle highly imbalanced data."},{"name":"An Automatic Computer-Aided Diagnosis System for Breast Cancer in Digital Mammograms via Deep Learning","publisher":"Journal of Medical and Biological Engineering","releaseDate":"2018-01-01","url":"","summary":"Presents an automatic computer-aided diagnosis system for breast cancer in digital mammograms using deep neural networks."},{"name":"Enhanced 3D Human Pose Recognition via Fusion of Depth and Motion Sensors","publisher":"International Journal of Future Computer and Communication","releaseDate":"2015-01-01","url":"","summary":"Combines depth and motion sensors to improve three-dimensional human pose recognition accuracy."},{"name":"Automatic Computer-Aided Diagnosis of Breast Cancer in Digital Mammograms via Deep Belief Network","publisher":"Global Conference on Engineering and Applied Science","releaseDate":"2016-07-19","url":"","summary":"Develops a computer-aided diagnosis system for breast cancer using a deep belief network."},{"name":"A Single Depth Sensor Based Human Activity Recognition via Convolutional Neural Network","publisher":"Indonesian Biomedical Engineering Society Conference on the Development of Biomedical Engineering","releaseDate":"2016-06-27","url":"","summary":"Proposes a human-activity recognition method using a single depth sensor and convolutional neural network."},{"name":"A Single Depth Sensor Based Human Activity Recognition via Deep Belief Network","publisher":"World Conference on Applied Sciences, Engineering and Technology","releaseDate":"2015-10-24","url":"","summary":"Utilises deep belief networks with depth sensors for human-activity recognition."},{"name":"Unsupervised 3D human pose recognition from a single depth human silhouette using a geodesic map and kinematic body model","publisher":"International Conference on Ubiquitous Information Management and Communication","releaseDate":"2015-01-01","url":"","summary":"Explores unsupervised 3D human pose recognition using geodesic maps and kinematic body models from a single depth silhouette."},{"name":"Improved 3D human skeletal pose reconstruction using the probability distribution of random forests in body parts recognition and generalised Gaussians estimation","publisher":"The Korea Society of Medical & Biological Engineering","releaseDate":"2013-11-01","url":"","summary":"Improves 3D human skeleton reconstruction using random-forest probability distributions and generalised Gaussians estimation."},{"name":"A novel computer-aided diagnosis system for breast cancer in digital mammograms via deep belief network","publisher":"The Korea Society of Medical & Biological Engineering","releaseDate":"2016-05-01","url":"","summary":"Describes a novel computer-aided diagnosis system for breast cancer using a deep belief network."},{"name":"End-to-End Transformer-Based Open-Vocabulary Keyword Spotting with Location-Guided Local Attention","publisher":"Interspeech 2021","releaseDate":"2021-08-30","url":"","summary":"Presents an end-to-end transformer-based open-vocabulary keyword-spotting system employing location-guided local attention."}],"skills":[{"name":"AI & Computer Vision","level":"","icon":"","keywords":["On-Device AI","Computer Vision","Machine Learning","Biometric Security","Industrial AI"]},{"name":"Programming Languages","level":"","icon":"","keywords":["C++","Python","C","Java","JavaScript","PHP","HTML","SQL","MFC","Matlab"]},{"name":"Frameworks","level":"","icon":"","keywords":["PyTorch"]}]}